const foodCostData = {
  "苗王": {
    "成人": {
      "早餐": 2200,
      "晚餐": 5390,
      "早晚餐": 7590
    },
    "孩童": {
      "早餐": 1760,
      "晚餐": 4312,
      "早晚餐": 6072
    },
  },
  "輕井澤": {
    "成人": {
      "早餐": 3500,
      "晚餐": 6500,
      "早晚餐": 10000
    },
    "孩童": {
      "早餐": 2500,
      "晚餐": 4600,
      "早晚餐": 7100
    },
  },
  "雫石": {
    "成人": {
      "早餐": 2300,
      "晚餐": 4500,
      "早晚餐": 6800
    },
    "孩童": {
      "早餐": 1300,
      "晚餐": 2900,
      "早晚餐": 4200
    },
    "幼兒": {
      "早餐": 1000,
      "晚餐": 1700,
      "早晚餐": 2700
    }
  },
  "萬座": {
    "成人": {
      "早餐": 2200,
      "晚餐": 6050,
      "早晚餐": 8250
    },
    "孩童": {
      "早餐": 1540,
      "晚餐": 4235,
      "早晚餐": 5775
    },
  },
  "志賀": {
    "成人": {
      "早餐": 2700,
      "晚餐": 540,
      "早晚餐": 8100
    },
    "孩童": {
      "早餐": 1890,
      "晚餐": 3780,
      "早晚餐": 5670
    },
  },
}

const foodTextMappingData = {
  "I4YC": "早餐",
  "I4YM": "早晚餐",
  "朝食付": "早餐",
  "朝夕食付": "早晚餐",
  "夕食付": "晚餐"
}

const roomDiscountData = {
  "萬座": {
    "孩童": 0.7
  }
}

const roomTypePriceShiftMap = {
  "萬本和10": "萬本家庭38",
  "萬東雙床19.2": "買取萬南雙床24"
}
const roomTypeMap = {
  "苗王6館 18.9": "苗王6號館雙床房B 18.9",
  "苗王6館 25.9": "苗王6號館三人房A 25.9",
  "苗王6館遊河 37.8": "苗王6號館遊ROOM河岸 37.8",
  "苗王4館 19.6": "苗王4號館雙床房B 19.6",
  "苗王4館 25.6": "苗王4號館三人房A 25.6",
  "苗王2館暖吊雪 35.8": "苗王2號館暖ROOM\n吊床/森林/河岸C 35.8",
  "苗王2館家雙床A 35.8": "苗王2號館家庭房C 35.8",
  "苗王2館家雙床B 30.8": "苗王2號館家庭房D 30.8",
  "苗王2館暖森河 30.8": "苗王2號館暖ROOM\n吊床/森林/河岸D 30.8"
}

const columnMap = {
  "表4": {
    "房型": 3,
    "房費": 4,
    "餐食": 5,
    "入湯稅": 6,
    "手續費": 7,
    "總計": 9
  },
  "房表": {
    "房型": 11,
    "房費": 12,
    "餐食": 13,
    "入湯稅": 14,
    "手續費": 15,
    "總計": 17
  },
}